def area(a, b):
    """
    Вычисляет площадь прямоугольника.
    Аргументы:
        a (int): длина прямоугольника.
        b (int): ширина прямоугольника.
    Возвращает:
        int: площадь прямоугольника.
    Пример вызова:
        area(4, 5)
        20
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника.
    Аргументы:
        a (int): длина прямоугольника.
        b (int): ширина прямоугольника.
    Возвращает:
        int: периметр прямоугольника.
    Пример вызова:
        perimeter(4, 5)
        18
    """
    return 2 * (a + b)
